In [1]:
import pandas as pd

In [28]:
labels = pd.read_csv('s1-label.csv', header=None)
data = pd.read_csv("s1.csv", header=None, delimiter=r"\s+")
data['label'] = labels
#data.rename(columns={"": "x", "": "y"})

In [30]:
data.head()

        0       1  label
0  664159  550946      1
1  665845  557965      1
2  597173  575538      1
3  618600  551446      1
4  635690  608046      1

In [34]:
data.to_csv("synthetic_2d_data.csv", index=False)
res = pd.read_csv("synthetic_2d_data.csv")
res.head()

        0       1  label
0  664159  550946      1
1  665845  557965      1
2  597173  575538      1
3  618600  551446      1
4  635690  608046      1